{"data":{"mdx":{"html":"<div><p><a class=\"gatsby-resp-image-link\" href=\"/static/95c082808e2cbbb4fcb249f0b77ebd9a/78abb/windows.jpg\" style=\"display:block\" target=\"_blank\" rel=\"noopener\"><span class=\"gatsby-resp-image-wrapper\" style=\"position:relative;display:block;max-width:590px;margin-left:auto;margin-right:auto\"><span class=\"gatsby-resp-image-background-image\" style=\"padding-bottom:25.083333333333336%;position:relative;bottom:0px;left:0px;background-size:cover;display:block\"></span><img class=\"gatsby-resp-image-image\" style=\"width:100%;height:100%;margin:0px;vertical-align:middle;position:absolute;top:0px;left:0px;box-shadow:inset 0px 0px 0px 400px white\" alt=\"Image of windows\" title=\"\" src=\"/static/95c082808e2cbbb4fcb249f0b77ebd9a/a6d7d/windows.jpg\" srcSet=\"/static/95c082808e2cbbb4fcb249f0b77ebd9a/51d5b/windows.jpg 148w,\n/static/95c082808e2cbbb4fcb249f0b77ebd9a/9118c/windows.jpg 295w,\n/static/95c082808e2cbbb4fcb249f0b77ebd9a/a6d7d/windows.jpg 590w,\n/static/95c082808e2cbbb4fcb249f0b77ebd9a/ea746/windows.jpg 885w,\n/static/95c082808e2cbbb4fcb249f0b77ebd9a/9b641/windows.jpg 1180w,\n/static/95c082808e2cbbb4fcb249f0b77ebd9a/78abb/windows.jpg 1200w\" sizes=\"(max-width: 590px) 100vw, 590px\"/></span></a></p><p>I want to make it clear that these opinions are my own and reflect only my experience. My employer is an amazing place to work if you can get your foot in the door. This complaint is with the <strong>hiring process</strong> only. There are some major issues with the hiring process that have made me extremely frustrated, to the point where I want to gripe about it.</p><h3>Into the void</h3><p>I&#x27;ve had many people reach out to me about applying, and as a developer there isn&#x27;t much more that I can do apart from give some general advice to prep for an interview and generating a referral.</p><p>The problem that has me furious is that after one of these individual applies, there&#x27;s little to no follow up from company. Only 13% of my referrals ever even received a response. The rest have sat in our recruiting system(s) as &quot;inactive&quot; or &quot;pending recruiter response&quot;. What bothers me about this is that this is polite and timely responses can be automated! Fire off an &#x27;Application Received&#x27; email; send a &#x27;Thank you for applying&#x27; once the position is closed; Deliver a &#x27;Sorry about the lack of response&#x27; message if an application has sat for X weeks without any recruiter activity.</p><p>Because this is so easy with modern systems and common-place at other companies, I find it <strong>extremely rude and inconsiderate</strong> to prospective employees for this company. I&#x27;ve now begun letting people know that they may not hear back at all, ever. 👎</p><h3>Got Privilege? ✅</h3><p>Another seemingly arbitrary requirement is that applicants must have a college degree. Seriously. I recently heard some spew about &quot;attempting to attract only the best&quot; but this ignores the fact that this is a <em>very bad</em> policy for diversity &amp; inclusion. The number of minorities (specifically hispanic and black) who graduate from college is far lower than white/Europeans.\nI&#x27;m not trying to fight for affirmative action here, but this can lead to a form of candidate suppression: many qualified people are immediately excluded from the pool. There are so many individuals who are very smart and higher education wasn&#x27;t in the cards for them. Real world experience and a proven track record is equally valuable in my experience.</p><p>Anectodally, I heard that an offer was <strong>reneged</strong> because the applicant didn&#x27;t have a degree, regardless of their previous experience. WTF 😞</p><h3>Woe, woe, woe</h3><p>I <em>think</em> the main reason for this is because we have too few recruiters for the number of applicants. Our HR team is ~10 people in a company of 1500+ employees—that&#x27;s less than 1%. As a developer, I don&#x27;t know how many applications are received per opening but the two that I&#x27;ve been a part of have received 200+. That&#x27;s a lot of work for such a small team! The above mentioned practices really aren&#x27;t helping anything either. Its a people problem and a process problem.</p><p>Even more frustrating with the issue here is that there&#x27;s nothing I can really do. Sure, I could talk to someone higher up. I&#x27;ve complained somewhat openly to my coworkers. But honestly, there&#x27;s probably no real change that I can make. At least, not as a developer.</p><h3>On the bright side...</h3><p>Like I said at the beginning of this post, this company is <strong>great</strong> to work for if there was any possibility of being able to get an interview. I&#x27;m optimistic that the problems above are fairly easy to fix with just a few changes:</p><ul><li>Setup automated communications</li><li>Find flaws in the application pipeline and solve</li><li>Hire more/better personnel</li><li>Remove the hard requirement of university degrees</li></ul><p>I retain the hope that someday this company can better their hiring processes and become a place to which I would recommend any of my developer friends.</p></div>","frontmatter":{"title":"Why I won't recommend my employer","date":"Jun 07, 2017","tags":["employment"]}}},"pageContext":{"slug":"/2017-06-07-why-I-wont-recommend-my-employer/"}}