{"head":{"title":"Must-have Apps: Windows edition","date":"2016-07-28T00:00:00.000Z","layout":"Post","description":"I believe that developers can benefit and learn from others' favorite suite of tools. I'll go over my favorite applications that help me be…"},"body":"<p>I believe that developers can benefit and learn from others' favorite suite of tools. I'll go over my favorite applications that help me be as efficient and quick while working on a Mac.</p>\n<h3 id=\"launchy\"><a href=\"#launchy\" class=\"phenomic-HeadingAnchor\">#</a>Launchy</h3>\n<p>After switching to a Mac, I love Spotlight. I now have to use Windows computer at work, so I really missed having the Spotlight available. <a href=\"http://www.launchy.net/\">Launchy</a> achieves this on Windows really well, indexing the *.lnk files in your start menu and User folder, and making the shortcuts available using <code>ALT + SPACE</code>. It even does simple calculations (just like Spotlight!), allows for website shortcuts, and is themable. Its a tad better than Spotlight because of those last features.</p>\n<blockquote>\n<p>Pro tip: it can even run commands from the launcher. An example: hit <code>ALT + SPACE</code>, type cmd, hit <code>TAB</code>, and type a command that is available to your environment like <code>ping</code> or <code>ipconfig</code>. Life-changing? Probably not. But it does save me about 5 seconds!</p>\n</blockquote>\n<p>Launchy is free to use, but it is so valuable that you should consider making a donation if you use it.</p>\n<h3 id=\"greenshot\"><a href=\"#greenshot\" class=\"phenomic-HeadingAnchor\">#</a>Greenshot</h3>\n<p>I also really liked Mac's built in screenshot utility, mainly because of the drop shadow it automatically generates. They look high quality and ready to ship and share.\n<a href=\"http://getgreenshot.org/\">Greenshot</a> does all of that and a whole lot more. Here are some of the highlights:</p>\n<ul>\n<li>It shows a magnifier for precision start/finish points</li>\n<li>has a built in image editor that you can use to add drop shadow effects, \"torn paper\" effect, obfuscate text, highlight, and more</li>\n<li>\n<p>comes prepackaged with some snazzy plugins to automatically upload to Box, Imgur, and the whole Office Suite.</p>\n<ul>\n<li>It is missing integration with major services like Google Drive, Dropbox, and OneDrive but you can work around that by setting a default save location to be inside your local synced folder.</li>\n</ul>\n</li>\n<li>overrides the default <code>PrtScn</code> key and variations (eg. <code>ALT + PrtScn</code>) for quick and easy screenshots</li>\n</ul>\n<p>Seriously, this one is great for non-techy people too. One of my old Project Management teams adopted it solely because of the Jira integration plugin. Awesome! Plus Greenshot is open source and free!</p>\n<h3 id=\"colorcop\"><a href=\"#colorcop\" class=\"phenomic-HeadingAnchor\">#</a>ColorCop</h3>\n<p>Similar to Sip for Mac, <a href=\"http://colorcop.net/\">ColorCop</a> is a handy tool that lets you grab colors from anything on your screen. It automatically shows a magnified eyedropper so you can select a color with more precision. Its also configurable so it can automatically copy the HEX or RGB value to your clipboard. Great for when you need to pull colors from, say, a website mockup as a PSD file into your CSS file. ColorCop is free, but also accepts donations if you find it useful.</p>\n<h3 id=\"cmder\"><a href=\"#cmder\" class=\"phenomic-HeadingAnchor\">#</a>Cmder</h3>\n<p>I only recently was introduced to <a href=\"http://gooseberrycreative.com/cmder/\">Cmder</a>, a new project to fill the need for actually amazing and useful console emulators on Windows. It uses the popular Monokai color scheme right out of the box, utilizes msysgit to provide Unix commands in the PATH, offers tabs for multiple consoles, and is totally portable. This thing has won my heart over, and I will probably never use CygWin again. Its still a work in progress so visit <a href=\"https://github.com/bliker/cmder\">Cmder's Github repo</a> if you have issues.</p>\n","__filename":"posts/Must-have-Apps-Windows-edition.md","__url":"/posts/Must-have-Apps-Windows-edition/","__resourceUrl":"/posts/Must-have-Apps-Windows-edition/index.html","__dataUrl":"/posts/Must-have-Apps-Windows-edition/index.html.787a0bb65a0d04e2c3423e640535417f.json"}