{"data":{"allMdx":{"edges":[{"node":{"excerpt":"There've been some surprisingly incorrect assumptions made about \"microfrontends\" since it became a buzzword. Microservices in the browser (I prefer this term over microfrontends) are a totally new paradigm but there seem to be bad assumptions being…","id":"e1a9648c-4726-5a99-96cb-507805e211c8","frontmatter":{"title":"Bad Assumptions about Microfrontends","date":"Jul 20, 2019"},"fields":{"slug":"/bad-assumptions-about-microfrontends/"}}},{"node":{"excerpt":"It's 2019 and I still see new code being written which uses non-interactive elements as buttons. Let's rehash why this is a problem. Take this example code of a  div  that has a click handler bound to it:  Don't get hung up on how the event is being…","id":"98e4d044-fd04-541f-a37f-946c707e7cd6","frontmatter":{"title":"Accessible Buttons","date":"Mar 20, 2019"},"fields":{"slug":"/accessible-buttons/"}}},{"node":{"excerpt":"I recently started a new job and was able to request a new keyboard. I got the Anne Pro with Gateron Red switches, and have mostly liked it. I still felt like there were some improvements to be made, so I took a stab at it. Foam mod I noticed that…","id":"705e6cbb-7cb4-52c1-9968-492150a5b2e4","frontmatter":{"title":"Anne Pro mods","date":"Apr 17, 2018"},"fields":{"slug":"/2018-04-20-anne-pro-mods/"}}},{"node":{"excerpt":"I recently finished my first handwired Atreus keyboard, an ortholinear keyboard with 42 keys. I'm really happy with how it turned out and I'm just documenting how it went for me, as well as some reference for my future builds. I'm proud of how it…","id":"889d9817-8d07-5cde-b1bc-e423d368adb1","frontmatter":{"title":"Building my first handwired keyboard","date":"Feb 12, 2018"},"fields":{"slug":"/2018-02-12-building-my-first-handwired-keyboard/"}}},{"node":{"excerpt":"I've yet to reach the point in my career where I'm attached to a single framework. I've used Angular 2+ heavily for the last year at work, have recently rewritten an Angular 1 app in React, and have chosen to use Vue for my personal projects for now…","id":"c0c4372f-69ac-5df1-a249-f9d5e4f849ec","frontmatter":{"title":"The 👍 and 👎 parts of Angular","date":"Nov 30, 2017"},"fields":{"slug":"/2017-11-30-the-good-and-bad-of-angular/"}}},{"node":{"excerpt":"I've yet to reach the point in my career where I'm attached to a single framework. I've used Angular 2+ heavily for the last year at work, have recently rewritten and Angular 1 app in React, and have chosen to use Vue for my personal projects for now…","id":"4c17cd95-430c-5451-923c-ff0e1e2432c9","frontmatter":{"title":"The 👍 and 👎 parts of React","date":"Nov 30, 2017"},"fields":{"slug":"/2017-12-20-the-good-and-bad-of-react/"}}},{"node":{"excerpt":"I want to make it clear that these opinions are my own and reflect only my experience. My employer is an amazing place to work if you can get your foot in the door. This complaint is with the  hiring process  only. There are some major issues with…","id":"2d6aaf34-b88b-5a9c-b6fd-f83fd9286097","frontmatter":{"title":"Why I won't recommend my employer","date":"Jun 07, 2017"},"fields":{"slug":"/2017-06-07-why-I-wont-recommend-my-employer/"}}},{"node":{"excerpt":"I sometimes see developers ask \"Should I use React, or Angular, or Vue.js, or  [ insert new framework here ] ?\" and every time, I see fanatics immediately jump to recommending one without any real justification. Now, I'm no expert but I do have…","id":"b4675172-79a3-540c-be91-bc8b7191982b","frontmatter":{"title":"Practical thoughts on React and Angular","date":"May 31, 2017"},"fields":{"slug":"/2017-05-31-practical-thoughts-on-react-and-angular/"}}},{"node":{"excerpt":"I recently came across some interesting behavior with Angular's  ng-content  that I wanted to jot down so I can search for some answers. NgContent isn't well documented. Why isn't  ng-content  self-closing? ng-content  is to be used like any other…","id":"71f68d99-23e0-52bd-843f-e5335ba62aa1","frontmatter":{"title":"Thoughts on Angular: Ng-Content","date":"Apr 05, 2017"},"fields":{"slug":"/2017-04-05-thoughts-on-angular-ng-content/"}}},{"node":{"excerpt":"This last weekend I wanted to create a simple CSS framework that I can reuse for my own little projects. The end result is  Simple Style  (which is still a WIP as requirements come up). Surprisingly, using  npm as a build tool  made it extremely easy…","id":"95fdbf1e-da8e-592b-95f8-2b7284d6a516","frontmatter":{"title":"Building a CSS framework using npm","date":"Feb 14, 2017"},"fields":{"slug":"/2017-02-14-build-a-css-framework-using-npm/"}}},{"node":{"excerpt":"Time has passed, technology has improved, and my preferences have also changed. In this post I'll revisit my choice of tooling. Password manager Having put a password manager in place to store, generate, and access my passphrases has been one of the…","id":"b5f663ad-cd7a-50cf-80f8-da3f35db573e","frontmatter":{"title":"Cross-platform Revisited","date":"Feb 05, 2017"},"fields":{"slug":"/2017-02-05-crossplatform-revisited/"}}},{"node":{"excerpt":"There are lots of great resources out there for the front-end developer who wants to keep learning. I know that I've been able to glean much just from joining and listening to the right sources. Here's a list of my favorite people/blogs/podcasts to…","id":"1ba972e3-8b84-5ada-9814-27eb527ca0fb","frontmatter":{"title":"Recommended Resources","date":"Sep 22, 2016"},"fields":{"slug":"/2016-09-22-recommended-resources/"}}}]}},"pageContext":{}}